STOP_WORDS = set(
    """
    አንቺ አንተ እናንተ ያንተ ያንቺ የናንተ ራስህን ራስሽን ራሳችሁን    
    ነው ላይ እና ውስጥ ወደ ጋር ግን ጊዜ ነበር ነገር
    ደግሞ እንደ ይህ ሁሉ ብቻ ወይም አቶ በ ቀን 
    ናቸው ምን ከ የ በዚህ ሲሆን መሆኑን ስለ እንጂ    
    ብሎ እስከ ሆነ ከዚህ ይህን ሆኖ እንዲሁም ዛሬ የሚል
    እንደሆነ ምንም እንዲህ ያለ አብ እንዴት እኔ ቤተ አለ
    ዋና ያህል በማለት ዘንድ ብለው ይችላል የሆነ ሌሎች
    ልዩ ማድረግ ያለውን ጀምሮ ይሆናል ከሆነ
    ይህንን በሚል ሲል መሆን ኛ አሉ እነዚህ ለ እንኳን
    በመሆኑ ስለዚህ መሆኑ እኛ ያሉ ተብሎ ብለዋል በተለይ
    ቢሆን ለምን ቢሆንም ሆነው ይህም ይሁን
    የእኔ ራሴ እኛ የእኛ ራሳችን እራሳችሁ እሱ የእሱ ራሱ እሷ
    የእሷ እራሷ እነሱ እነሱን የእነሱ ራሳቸው ምንድን የትኛው
    ማን እነዚያ ነኝ ነበሩ ሁን ያለው አንድ ምክንያቱም እያለ
    መካከል በኩል በፊት በኋላ ከላይ ከታች ከ ታች ውጭ
    በላይ በታች ከዚያ እዚህ እዚያ መቼ የት ሁሉም ማንኛውም
    በጣም ሌላ አንዳንድ እንደዚህ አይ አይደለም የራሱ ይልቅ
    እንዲሁ
    """.split()
)
