data = [
    {
        "word": "ይጠራሉ", "meaning": "ኅብረ ቃል: ይጠራሉ\nሰም: ሁሉም ሰዎች ለግብር (ራት ግብዣ) ይጠራሉ\nወርቅ: ከሞት የሚቀር ማንም ሰው የለም"
    },
    {
        "word": "አልቦ",
        "meaning": "ኅብረ ቃል: አልቦ\nሰም: ወተት አልቦ አምጥቶልሻል ጠጪ ይደግፍሻል እንደ ሴት አዘጋጅቶ ባልሸ ያመጣልሽን እንቢ ማለት ጡር ይሆንብሻል\nወርቅ: ባልሽ የእግር አልቦሽን ይዞ ዘመድ አዝማድሽን ያስለቅሳል"
    },
    {
        "word": "በማማት", "meaning": "ኅብረ ቃል: በማማት\nሰም: ሰው በህማማት ሰሞን ጦም ይደክማል ሰውነቱ ይጎዳል\nወርቅ: ሰው ሁሉ የሚጎዳው በሐሜትና በነገር ነው"
    },
    {
        "word": "አምናና ካችአምና ደኀና ሰው ነበረች፣ በሽታዋ መጣ ትተኩስ ጀመረች፡፡",
        "meaning": "ኅብረ ቃል: ትተኩስ ጀመረች\nሰም: ዘንድሮ ሕመም አደረባት መሰለኝ ሰውነቷ ያተኩስ ጀመር\nወርቅ: የሠራችውን ሸክላ በእሳት መተኮስ ጀመረች ሥራዋን ቀጠለች የዘሯን ሞያ አረሳችም።"
    },
    {
        "word": "ሳያድለን", "meaning": "ኅብረ ቃል: ሳያድለን\nሰም: አሳላፊው ጠላና ጠጅ ሳይሰጠን ቀረ ዘለለን\nወርቅ: ሀብት ሰጭ የሆኑ ጌቶች ሁሉ ሳንታደል በመቅረታችን ግዛት ሳይሰጡን ቀሩ ከችግር አላወጡንም።"
    },
    {
        "word": "ዘሬን", "meaning": "ኅብረ ቃል: ዘሬን\nሰም: በቆላም በደጋም ያለዉን መሬቴን ዘርቼ ጨርሼያለሁ አዝመራዬን አጠናቅቄያለሁ\nወርቅ: በያለበት ያሉት ዘመዶቼ በሞት አለቁ ዘሮቼ ወገኖቼ ከዚህ አለም ተሟጠጡ።"
    },
    {
        "word": "በባል", "meaning": "ኅብረ ቃል:  በባል\nሰም: ብዙ ሆነን በበዓል ቀን (ባዘቦት) ብንፈልግ ይገኛል\nወርቅ: ከባል ጋራ አብሮ መኖር ከቁም ነገር ያደርሳል መውለድ መክበድ ይገኛል"
    },
    {
        "word": "አንዠት", "meaning": "ኅብረ ቃል: አንዠት\nሰም: አባት እናትሽ ሥጋ እርማቸው ነው አንቺ ግን አንጀት ሳይቀር ትበያለሽ\nወርቅ:  አንቺ ፍቅር ታውቂያሽ ትዝታሽ ከሆድ አይጠፋም አንጀት ይበላል ያብከነክናል"
    },
    {
        "word": "ባልጋ", "meaning": "ኅብረ ቃል: ባልጋ\nሰም: እዩዋት ባለጌ ሆና ከናት ካባቷ ፈቃድ ወጥታ ስትኮበልል የወላጆቿን ምክር ጥሳ ስትሄድ ተመልከቷት\nወርቅ: ሞታ በአልጋ ወደ ቤተክርስቲያን ለመቀበር ተጓዘች"
    },
{
        "word": "ሳይ", "meaning": "ኅብረ ቃል: ሳይ\nሰም፥ ሚስቴን ሳላይ ወሰዳት በስውር ይዟት ሄደ\nወርቅ፥ ሥዕል ሣይ ወሰዳት፣ አስኮበለላት፣ አስካዳት።"
    },
]