noun = {
    'synset_1': ['አበበ', 'አበባ', 'ከበደ', 'ለማ', 'ሰይፉ'],
    'synset_2': ['አበባ', 'እጽዋት', 'ችግኝ'],
    'synset_3': ['አምላክ', 'እግዚአብሄር', 'ጌታ'],
    'synset_4': ['ግብር'],
    'synset_6': ['ወተት'],
    'synset_7': ['አልቦ', 'የእግር ጌጥ'],
    'synset_8': ['ባልሽ', 'ባለቤትሽ'],
    'synset_9': ['ሁዳዴን'],
    'synset_10': ['መጎጃው', 'በትር'],
    'synset_11': ['በማማት', 'የበአል ቀን'],
    'synset_13': ['ወዳጅ', 'ዘመድ','ጓደኛ'],
    'synset_14': ['ጠላ'],
    'synset_15': ['ጠጅ'],
    'synset_16': ['አሳብም', 'ጭንቀት'],
    'synset_17': ['በቆላም', 'ሞቃታማ ቦታ'],
    'synset_18': ['በደጋም', 'ቀዝቃዛ ቦታ'],
    'synset_19': ['ዘሬን', 'የምዘራውን አዝመራዬ'],
    'synset_20': ['ዘሬን', 'ዘመዶቼን', 'ቤተሰቦቼን'],
    'synset_21': ['አሽከሬ', 'አገልጋዬ', 'ባሪያዬ'],
    'synset_22': ['በቅሎዬም', 'የምንቀሳቀስበት የቤት እንስሳዬም', 'የጋማ ከብት'],
    'synset_23': ['ጎጃሜ', 'አማራ'],
    'synset_24': ['በባል', 'በበዓል', 'የእረፍት ቀን'],
    'synset_25': ['በባል', 'በትዳር አጋር', 'በባለቤት'],
    'synset_26': ['ቀን', 'ብርሃን'],
    'synset_27': ['ቀን', 'መልካም ጊዜ'],
    'synset_28': ['ከፈቃድ', 'ከይሁንታ'],
    'synset_29': ['ወጣት', 'ልጅ', 'ለጋ'],
    'synset_30': ['ባልጋ', 'የትዳር አጋር ጋር'],
    'synset_31': ['ባልጋ', 'በአልጋ', 'በፍራሽ', 'በቃሬዛ'],
    'synset_32': ['ካችአምና', 'የዛሬ ሁለት አመት'],
    'synset_33': ['በሽታዋ', 'ህመሙዋ'],
    'synset_34': ['መጮህ', 'ደምጽ ማሰማት'],

}
# synset_1 related words with human names
# synset_2 words with name of flowers

verb = {
    'synset_1': ['አበበ', 'ለማ', 'ፈካ'],
    'synset_2': ['በላ', 'ዋጠ', 'አኘከ'],
    'synset_4': ['ነስቶ', 'ፊት መንሳት', 'ማግለል'],
    'synset_5': ['ነስቶ','ማከበር', 'ዝቅ ማለት'],
    'synset_7': ['ያበላል', 'ይመግባል'],
    'synset_8': ['ይጠራሉ', 'ንጹህ ይሆናሉ'],
    'synset_9': ['ይጠራሉ', 'ይመጣሉ'],
    'synset_10': ['ይጠራሉ', 'ሰው ይጠራሉ'],
    'synset_11': ['ጠጪ'],
    'synset_12': ['አልቦ','ወተት አላቦ'],
    'synset_14': ['ያስፈርድብሻል','ይከስሻል'],
    'synset_15': ['መሖደድ','መጦም'],
    'synset_16': ['በማማት','ሃሜት ማዉራት'],
    'synset_18': ['መጣ'],
    'synset_19': ['ትተኩስ','ራሱዋን መታመም'],
    'synset_20': ['ትተኩስ','በትይት መተኮስ'],
    'synset_21': ['የለብኝ','ነጻ ነኝ'],
    'synset_22': ['ዐርፌያለሁ', 'እረፍት አግኝቻለሁ'],
    'synset_23': ['ጨርሻለሁ', 'አጠናቅቄያለሁ'],
    'synset_24': ['ጠፍቶኛል', 'ከኔ ተሰውሯል'],
    'synset_25': ['አፋልገኝ', 'አብረን እናስስ'],
    'synset_26': ['ይገኛል', 'ይኖራል'],
    'synset_28': ['ንቃ', 'ተነስ'],
    'synset_30': ['እዩዋት', 'ተመልከቷት'],
    'synset_32': ['ያስቸግራል', 'ይረብሻል'],
    'synset_34': ['ይላሉ', 'ይናገራሉ'],
    'synset_35': ['ጀመረች', 'ተነሳች'],
    'synset_38': ['የለም'],
    'synset_39': ['ይሻልሻል', 'ይመረታል'],


}

adjective = {
    'synset_3': ['ቀሪ', 'የተረፈ'],
    'synset_4': ['ደኀና','ጥሩ'],
    'synset_5': ['ሁሉም', 'ሁሉ'],
    'synset_6': ['አንድም', 'ማንም'],
    'synset_7': ['እጅግ', 'በጣም'],
    'synset_8': ['አሳላፊው', 'ጠጅ አቅራቢው'],
    'synset_9': ['አራሲቱ', 'የወለደችው'],

}

adverb = {
    'synset_7': ['ባልጋ', 'ባለጌ ሆና'],
    'synset_2': ['ጠርቶ', 'ኑ ብሎ'],
    'synset_3': ['ጠርቶ', 'ንጹ ሆኖ'],
    'synset_6': ['የግድ', 'በግዴታ'],
    'synset_7': ['ንቃ'],
    'synset_8': ['ስትሄድ', 'ስትጓዝ'],
    'synset_9': ['ይዞ'],
    'synset_10': ['ሳያድለን', 'ሳይሰጠን'],
    'synset_11': ['ሳያድለን', 'እድለኛ ሳንሆን'],
    'synset_12': ['ወጥታ', 'ሄዳ'],
    'synset_13': ['ባይሆነን', 'ልካችን ባይሆን'],
    'synset_14': ['አምና','እውነት ነው ብላ'],

}


# for example:
# abebab can have two noun meanings in noun synset_1 and synset_2
# abebe will have two meaning one in noun synset_1 and in verb sysnset_1

# so since abeba has two noun menaing it will have high chance of being hebir kal

# so this is how we do the wordnet......
